We will analyze the Uber Pickups in New York City dataset. This is more of a data visualization project

https://data-flair.training/blogs/r-data-science-project-uber-data-analysis/

Data source:

https://www.kaggle.com/fivethirtyeight/uber-pickups-in-new-york-city/data

In [1]:
%matplotlib inline

# pretty display of variables
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
#!dir "./data/uber-pickups-in-new-york-city"

In [3]:
import pandas as pd

In [4]:
apr_data = pd.read_csv("./data/uber-pickups-in-new-york-city/uber-raw-data-apr14.csv")
may_data = pd.read_csv("./data/uber-pickups-in-new-york-city/uber-raw-data-may14.csv")
jun_data = pd.read_csv("./data/uber-pickups-in-new-york-city/uber-raw-data-jun14.csv")
jul_data = pd.read_csv("./data/uber-pickups-in-new-york-city/uber-raw-data-jul14.csv")
aug_data = pd.read_csv("./data/uber-pickups-in-new-york-city/uber-raw-data-aug14.csv")
sep_data = pd.read_csv("./data/uber-pickups-in-new-york-city/uber-raw-data-sep14.csv")

In [5]:
frames = [apr_data, may_data, jun_data, jul_data, aug_data, sep_data]
uber_2014  = pd.concat(frames)

In [6]:
uber_2014.shape

(4534327, 4)

In [7]:
uber_2014.head(10)

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512
5  4/1/2014 0:33:00  40.7383 -74.0403  B02512
6  4/1/2014 0:39:00  40.7223 -73.9887  B02512
7  4/1/2014 0:45:00  40.7620 -73.9790  B02512
8  4/1/2014 0:55:00  40.7524 -73.9960  B02512
9  4/1/2014 1:01:00  40.7575 -73.9846  B02512

In [8]:
 data_2014 = uber_2014.sample(frac=0.01, replace=False, random_state=1);

Let's work and prototype on as maller simple, for themoment.

In [9]:
data_2014.shape

(45343, 4)

In [10]:
data_2014.columns

Index(['Date/Time', 'Lat', 'Lon', 'Base'], dtype='object')

In [11]:
# lets rename our Date/Time column for an easier handeling.

In [12]:
data_2014.rename(columns={'Date/Time':'DateTime'}, inplace=True)

In [13]:
data_2014.columns

Index(['DateTime', 'Lat', 'Lon', 'Base'], dtype='object')

In [14]:
data_2014.head()

                  DateTime      Lat      Lon    Base
753909  8/26/2014 19:49:00  40.7270 -73.9767  B02682
601873  8/31/2014 14:40:00  40.7482 -73.9927  B02617
890927  9/10/2014 15:48:00  40.7557 -73.9895  B02764
433155  8/15/2014 20:47:00  40.7081 -74.0116  B02617
169714  9/17/2014 15:10:00  40.7417 -73.9894  B02598

In [15]:
data_2014.shape

(45343, 4)

In [16]:
data_2014.Base.value_counts()

B02617    14574
B02598    14055
B02682    12066
B02764     2641
B02512     2007
Name: Base, dtype: int64

In [17]:
data_2014.isna().sum()

DateTime    0
Lat         0
Lon         0
Base        0
dtype: int64

In [18]:
# no NAs to deal with.

In [19]:
data_2014.dtypes

DateTime     object
Lat         float64
Lon         float64
Base         object
dtype: object

In [20]:
data_2014.DateTime.head(10)

753909    8/26/2014 19:49:00
601873    8/31/2014 14:40:00
890927    9/10/2014 15:48:00
433155    8/15/2014 20:47:00
169714    9/17/2014 15:10:00
596910      7/2/2014 5:49:00
192011    8/22/2014 16:31:00
162364    9/16/2014 16:25:00
475752    7/22/2014 16:50:00
832047    9/27/2014 21:46:00
Name: DateTime, dtype: object

In [21]:
data_2014.DateTime = pd.to_datetime(data_2014.DateTime)

In [22]:
data_2014.head(10)

                  DateTime      Lat      Lon    Base
753909 2014-08-26 19:49:00  40.7270 -73.9767  B02682
601873 2014-08-31 14:40:00  40.7482 -73.9927  B02617
890927 2014-09-10 15:48:00  40.7557 -73.9895  B02764
433155 2014-08-15 20:47:00  40.7081 -74.0116  B02617
169714 2014-09-17 15:10:00  40.7417 -73.9894  B02598
596910 2014-07-02 05:49:00  40.7675 -73.8666  B02682
192011 2014-08-22 16:31:00  40.7596 -73.9738  B02598
162364 2014-09-16 16:25:00  40.6466 -73.7894  B02598
475752 2014-07-22 16:50:00  40.7642 -73.9818  B02617
832047 2014-09-27 21:46:00  40.7146 -73.9504  B02682

In [23]:
data_2014.dtypes

DateTime    datetime64[ns]
Lat                float64
Lon                float64
Base                object
dtype: object

### Plotting the trips by the hours in a day

In [24]:
%matplotlib inline
import seaborn as sns; sns.set()

In [25]:
data_2014.DateTime.head(10)

753909   2014-08-26 19:49:00
601873   2014-08-31 14:40:00
890927   2014-09-10 15:48:00
433155   2014-08-15 20:47:00
169714   2014-09-17 15:10:00
596910   2014-07-02 05:49:00
192011   2014-08-22 16:31:00
162364   2014-09-16 16:25:00
475752   2014-07-22 16:50:00
832047   2014-09-27 21:46:00
Name: DateTime, dtype: datetime64[ns]

In [31]:
# set DateTime as index
data_2014 = data_2014.set_index('DateTime')
data_2014.head(10)

                         Lat      Lon    Base
DateTime
2014-08-26 19:49:00  40.7270 -73.9767  B02682
2014-08-31 14:40:00  40.7482 -73.9927  B02617
2014-09-10 15:48:00  40.7557 -73.9895  B02764
2014-08-15 20:47:00  40.7081 -74.0116  B02617
2014-09-17 15:10:00  40.7417 -73.9894  B02598
2014-07-02 05:49:00  40.7675 -73.8666  B02682
2014-08-22 16:31:00  40.7596 -73.9738  B02598
2014-09-16 16:25:00  40.6466 -73.7894  B02598
2014-07-22 16:50:00  40.7642 -73.9818  B02617
2014-09-27 21:46:00  40.7146 -73.9504  B02682

In [37]:
data_2014.columns

Index(['Lat', 'Lon', 'Base'], dtype='object')

In [40]:
# https://www.dataquest.io/blog/tutorial-time-series-analysis-with-pandas/